Repository: Parozzz/TiaUtilities
Catalog: TiaUtilities/Languages/Locale.*.resx
Languages: it

# ALARM_CONFIG_COIL2_TYPE
source: Coil 2 Type
it: Tipo Bobina 2

# ALARM_CONFIG_COIL_TYPE_COIL
source: Coil
it: Bobina

# ALARM_CONFIG_COIL_TYPE_NONE
source: Ignore
it: Ignora

# ALARM_CONFIG_DEFAULTS
source: Field default Values
it: Valori default campi

# ALARM_CONFIG_DEFAULTS_COIL1
source: Coil 1
it: Bobina 1

# ALARM_CONFIG_DEFAULTS_COIL2
source: Coil 2
it: Bobina 2

# GENERICS_ADDRESS
source: Address
it: Indirizzo

# GENERICS_TYPE
source: Type
it: Tipo

# GENERICS_VALUE
source: Value
it: Valore

# GENERICS_LOAD
source: Load
it: Apri

# GENERICS_NAME
source: Name
it: Nome

# GENERICS_NUMBER
source: Number
it: Numero

# GENERICS_SAVE
source: Save
it: Salva

# GENERICS_SAVE_AS
source: SaveAs
it: Salva Come

# ALARM_CONFIG_GENERATION
source: Generation
it: Generazione

# ALARM_CONFIG_GENERATION_ANTI_SLIP_AMOUNT
source: Group Size
it: Dimensioni Gruppo

# ALARM_CONFIG_GENERATION_ANTI_SLIP_GEN_EMPTY
source: Generate Empty
it: Genera Vuoti

# ALARM_CONFIG_GENERATION_EMPTY
source: Generation Empty
it: Generazione Vuoti

# ALARM_CONFIG_GENERATION_EMPTY_ALARM_ADDRESS
source: Alarm Address
it: Indirizzo Allarme

# ALARM_CONFIG_GENERATION_EMPTY_NUM
source: Num. at end
it: Quantit√† alla fine

# ALARM_CONFIG_GENERATION_EMPTY_TIMER_ADDRESS
source: Address
it: Indirizzo

# ALARM_CONFIG_GENERATION_EMPTY_TIMER_TYPE
source: Type
it: Tipo

# ALARM_CONFIG_GENERATION_EMPTY_TIMER_VALUE
source: Time
it: Tempo

# ALARM_CONFIG_GENERATION_FORMAT
source: Format
it: Formato

# ALARM_CONFIG_GENERATION_SKIP
source: Skip after each group
it: Salta a fine gruppo

# ALARM_CONFIG_GENERATION_START_NUM
source: Starting Num.
it: Num. partenza

# ALARM_CONFIG_GROUPING_TYPE
source: Grouping type
it: Tipo raggruppamento

# ALARM_CONFIG_GROUPING_TYPE_GROUP
source: GroupPerSegment
it: GruppoPerSegmento

# ALARM_CONFIG_GROUPING_TYPE_ONE
source: OnePerSegment
it: UnoPerSegmento

# ALARM_CONFIG_PARTITION_TYPE
source: Partition type
it: Tipo ripartizione

# ALARM_CONFIG_PARTITION_TYPE_ALARM_TYPE
source: AlarmType
it: PerTipoAllarme

# ALARM_CONFIG_PARTITION_TYPE_DEVICE
source: Device
it: PerUtenza

# ALARM_CONFIG_PREFIX
source: Field Prefixes
it: Prefissi Campi

# ALARM_CONFIG_PREFIX_ALARM
source: Alarm Address
it: Indirizzo Allarme

# ALARM_CONFIG_PREFIX_COIL1
source: Coil 1 Address
it: Indirizzo Bobina 1

# ALARM_CONFIG_PREFIX_COIL2
source: Coil 2 Address
it: Indirizzo Bobina 2

# ALARM_CONFIG_PREFIX_TIMER
source: Timer Address
it: Indirizzo Timer

# ALARM_CONFIG_SEGMENT_NAME
source: Segment Names
it: Nomi segmenti

# ALARM_CONFIG_SEGMENT_NAME_GROUP_EACH
source: Groupped
it: Raggruppati

# ALARM_CONFIG_SEGMENT_NAME_GROUP_EACH_EMPTY
source: Groupped(Empty)
it: Raggruppati(Vuoti)

# ALARM_CONFIG_SEGMENT_NAME_ONE_EACH
source: One each
it: Singoli

# ALARM_CONFIG_SEGMENT_NAME_ONE_EACH_EMPTY
source: One each(Empty)
it: Singoli(Vuoti)

# ALARM_CONFIG_TEXT_LIST
source: Alarm Text List
it: Lista Testi Allarmi

# ALARM_CONFIG_TEXT_LIST_EMPTY
source: Empty
it: Vuoto

# ALARM_CONFIG_TEXT_LIST_FULL
source: Full
it: Pieno

# ALARM_DATA_ALM_VARIABLE
source: Alarm Variable
it: Variabile allarme

# ALARM_DATA_CUSTOM_VAR_ADDR
source: Custom Variable
it: Var. custom

# ALARM_DATA_COIL1_ADDRESS
source: Coil1 Address
it: Indirizzo bobina1

# ALARM_DATA_COIL2_ADDRESS
source: Coil2 Address
it: Indirizzo bobina2

# ALARM_DATA_DESCRIPTION
source: Description
it: Descrizione

# ALARM_DATA_ENABLE
source: Enable
it: Abilita

# ALARM_DATA_TIMER_ADDRESS
source: Timer Address
it: Indirizzo timer

# ALARM_DATA_TIMER_TYPE
source: Type
it: Tipo

# ALARM_DATA_TIMER_VALUE
source: Time
it: Tempo

# ALARM_GEN_FORM
source: Alarms generator. Project file: {file_path}
it: Generazione Allarmi. Percorso progetto: {file_path}

# DEVICE_DATA_DESCRIPTION
source: Description
it: Descrizione

# DEVICE_DATA_NAME
source: Name
it: Nome

# ALARM_CONFIG_COIL1_TYPE
source: Coil 1 Type
it: Tipo Bobina 1

source: Grid Preferences
it: Preferenze Griglia

# GRID_PREFERENCES_DRAGGED_CELL_BACK
source: Dragged cell background
it: Sfondo cella trascinamento

# GRID_PREFERENCES_DRAG_TRIANGLE_COLOR
source: Drag triangle
it: Triangolo trascinamento

# GRID_PREFERENCES_PREVIEW_FORE
source: Preview
it: Anteprima

# GRID_PREFERENCES_SELECTED_CELL_BORDER
source: Selected cell border
it: Bordo cella selezionata

# GRID_SCRIPT_JS_EXPRESSION
source: Javascript Expression
it: Espressione Javascript

# GRID_SCRIPT_JSON_CONTEXT
source: JSON Context
it: Contesto JSON

# GRID_SCRIPT_VARIABLES
source: Variables:
it: Variabili:

# GRID_SCRIPT_EXECUTE_ONE_LINE
source: Execute on selected line
it: Esegui su riga selezionata

# GRID_SCRIPT_EXECUTE_ALL
source: Execute on all lines
it: Esegui su tabella

# GRID_SCRIPT_AUTO_FORMAT
source: Format Code
it: Auto Formattazione

# GRID_FIND_SEARCH_COMPLETED
source: Search completed
it: Operazione completata

# GRID_FIND_REPLACE_ALL_COMPLETED
source: Search completed. Replaced {count} values.
it: Operazione completata. Sostituiti {count} valori.

# GRID_FIND_REPLACE_ALL_BUTTON
source: ReplaceAll
it: Sostituisci Tutti

# GRID_FIND_REPLACE_BUTTON
source: Replace
it: Sostituisci

# GRID_FIND_MATCH_CASE_CHECKBOX
source: Match Case
it: Rispetta Maiuscole

# GRID_FIND_FIND_BUTTON
source: Find
it: Cerca

# GRID_FIND_FORM_NAME
source: Grid - Find and Replace
it: Grid - Trova e Sostituisci

# IO_CONFIG_GROUPING_TYPE
source: Grouping Type
it: Tipo Raggruppamento

# IO_CONFIG_GROUPING_TYPE_BIT
source: GroupEachBit
it: RaggruppaPerBit

# IO_CONFIG_GROUPING_TYPE_BYTE
source: GroupEachByte
it: RaggruppoPerByte

# IO_CONFIG_MEMORY_TYPE
source: Memory Type
it: Tipo memoria

# IO_DATA_ADDRESS
source: Address
it: Indirizzo

# IO_DATA_COMMENT
source: Comment
it: Commento

# IO_DATA_IO_NAME
source: IO Tag
it: Merker IO

# IO_DATA_MERKER_ADDRESS
source: Merker Address
it: Assoluto

# IO_DATA_VARIABLE
source: Variable
it: Appoggio

# IO_GEN_CONFIG_ALIAS_DB
source: Alias DB
it: DB Appoggi

# IO_GEN_CONFIG_ALIAS_DB_GENERATED_DEFINED_VARIABLES
source: Genera Defined variables
it: Genera Variabili Definite

# IO_GEN_CONFIG_ALIAS_DB_IN_DEFAULT
source: Default Input value
it: Valore default Input

# IO_GEN_CONFIG_ALIAS_DB_OUT_DEFAULT
source: Default Output value
it: Valore default Output

# IO_GEN_CONFIG_ALIAS_TABLE
source: Alias Table
it: Tabella Appoggi

# IO_GEN_CONFIG_ALIAS_TABLE_INPUT_VARIABLE
source: Input Variable
it: Variable Input

# IO_GEN_CONFIG_ALIAS_TABLE_NEW_EVERY
source: New every n° bit
it: Nuova ogni n¬∞ bit

# IO_GEN_CONFIG_ALIAS_TABLE_OUTPUT_VARIABLE
source: Output Variable
it: Variabile Output

# IO_GEN_CONFIG_ALIAS_TABLE_VARIABLE_DEFAULT
source: Default Value
it: Valore di Default

# IO_GEN_CONFIG_ALIAS_TABLE_VARIABLE_START_ADDRESS
source: Start Address
it: Indirizzo di Partenza

# IO_GEN_CONFIG_FC
source: Alias FC
it: FC Appoggi

# IO_GEN_CONFIG_IO_TABLE
source: IN/OUT Table
it: Tabella IN/OUT

# IO_GEN_CONFIG_IO_TABLE_DEFAULT_NAME
source: Default tag name
it: Nome default tag

# IO_GEN_CONFIG_IO_TABLE_NEW_EVERY
source: New every n° bit
it: Nuova ogni n¬∞ bit

# IO_GEN_CONFIG_SEGMENT
source: Segment Name
it: Nomi Segmenti

# IO_GEN_CONFIG_SEGMENT_BIT_DIVISION
source: Division per bit
it: Divisione per bit

# IO_GEN_CONFIG_SEGMENT_BYTE_DIVISION
source: Division per byte
it: Divisione per byte

# IO_GEN_FORM_NAME
source: Input/Output alias generator. Project file: {file_path}
it: Generatore Appoggi Input/Output. Percorso progetto: {file_path}

# IO_GEN_FORM_IMPEXP_EXPORT_XML
source: Export XML
it: Esporta XML

# IO_GEN_FORM_IMPEXP_IMPORT_EXCEL
source: Import Excel
it: Importa Excel

# IO_GEN_FORM_IMPEXP_IMPORT_SUGGESTION
source: Import Suggestions From DB or Tag table
it: Importa Suggerimenti da DB/Tabella

# IO_SUGGESTION_DATA_VALUE
source: Prompt
it: Suggerimento

# MAIN_FORM_LANGUAGE
source: Language
it: Lingua

# MAIN_FORM_TIA_VERSION
source: TIA Portal Version
it: Versione TIA Portal

# MAIN_FORM_TOP_ALARM_GENERATOR
source: Alarm Generator
it: Generatore Allarmi

# MAIN_FORM_TOP_DB_DUPLICATION
source: DB Duplication
it: Duplicazione DB

# MAIN_FORM_TOP_FILE_AUTO_SAVE
source: AutoSave (s)
it: AutoSalvataggio (s)

# MAIN_FORM_TOP_IO_GENERATION
source: Alias Generator
it: Generatore Appoggi

# ALARM_CONFIG_GENERATION_EMPTY_ANTI_SLIP
source: Generate in anti-slip
it: Genera durante anti-slip

# IO_DATA_NEGATED
source: Negated
it: Negato

# ALARM_DATA_COIL1_TYPE
source: Type
it: Tipo

# ALARM_DATA_COIL2_TYPE
source: Type
it: Tipo

# GRID_SCRIPT_OPEN_JAVASCRIPT_CONTEXT
source: Open Javascript executed
it: Apri esecutore Javascript

# GENERICS_COMMENT
source: Comment
it: Commento

# GENERICS_CONFIGURATION
source: Configuration
it: Configurazione

# IO_GEN_EXCELIMPORT_IO_NAME
source: IO Name
it: Nome IO

# IO_GEN_EXCELIMPORT_STARTING_ROW
source: Starting row
it: Riga di partenza

# IO_GEN_EXCELIMPORT_EXPRESSION
source: JS Expressione for row validation
it: Espressione JS validit√† riga

# IO_GEN_EXCELIMPORT_IMPORT
source: Import Excel
it: Importa Excel

# GENERICS_ACCEPT
source: Accept
it: Accetta

# GENERICS_CANCEL
source: Cancel
it: Cancella

# GENERICS_CLEAR
source: Clear
it: Pulisci

# IO_GEN_FORM_IMPEXP_IMPORT_IO
source: Import IO from Tag table
it: Importa IO da Tabella

# ALARM_CONFIG_DEFAULTS_CUSTOM_VAR
source: Custom variable
it: Variabile numerica custom
